---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultusegmentRampRiser
source: html/a166c163-d131-d0be-c333-48c1caabf041.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultusegmentRampRiser Property

Ramp can't have multisegment Riser.

## Syntax (C#)
```csharp
public static FailureDefinitionId MultusegmentRampRiser { get; }
```